<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"web1/production","backend":"b91471b70cdd266218a5131fb67fdb5baa12ff618a55de8ca9665ce1cb1ed1f1","plan_job_ref":"Job Generate OpenTofu Plan #110 at https://github.com/alexdragongc/test-vercel-backend-hello-world-iac/actions/runs/22148745712","plan_out_hash":"e406cbc273702b61ac571d7e4a41a412455db31ffe7618a91fc483efbcb2b4f3","plan_hash":"4c422f9c7818bb56bd163f9a640c783f2d326a498ac482ef495f138e639fb200","plan_text_format":"diff","version":"2.2.3","closed":true} -->
OpenTofu plan for __web1/production__
<details>
<summary>Plan: 0 to add, 1 to change, 0 to destroy.</summary>

```diff
OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place (current -> planned)

OpenTofu will perform the following actions:

  # vercel_project.my_project will be updated in-place
!~  resource "vercel_project" "my_project" {
+       build_machine_type                                = (known after apply)
+       enable_preview_feedback                           = (known after apply)
+       git_provider_options                              = (known after apply)
        id                                                = "prj_LNiPwjtv3VyAzq23rCnWH0t10MCi"
-       ignore_command                                    = "exit 0" -> null
        name                                              = "web1"
+       preview_comments                                  = (known after apply)
+       protection_bypass_for_automation_secret           = (sensitive value)
!~      resource_config                                   = {
+           function_default_cpu_type = (known after apply)
+           function_default_timeout  = (known after apply)
#            (2 unchanged attributes hidden)
        }
!~      serverless_function_region                        = "iad1" -> (known after apply)
+       team_id                                           = (known after apply)
#        (19 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```
</details>

:white_check_mark: Plan applied in [Apply OpenTofu Plan #63](https://github.com/alexdragongc/test-vercel-backend-hello-world-iac/actions/runs/22148801392)